{
  "document_id": "DIVAMI_006",
  "raw_text": "\n\n\n\n\nCOMMUNITY SERVICE REPORT\nYOUNGISTAAN FOUNDATION\n\n\n\n\n\n\n\n\n\n\n\nDate: 16th February 2024\nSubmitted By: G Yashaswini (2023001306)\nMahita K (2023001274)\nMancy Reddy (2023001123)\nT Sri Lalitha (2023001418)\nSubmitted To: Dr. Tushar Banekar\nDepartment of English, GITAM University\n\n\n\n1. Introduction:\na. About Homelessness:\nPeople living on the streets are one of the most overlooked and neglected people in the country, and number anywhere between 1.7 million (official estimates) to 3 million people (civil society estimates). It is estimated that most of the homeless in India live in urban areas located on the outskirts of cities under bridges or other public areas where they are permitted to seek shelter. \nHomelessness can lead to a multitude of other problems such as poor health and disease, substance abuse, child labour, trafficking.\nIt cuts off access to health care and many basic services. Homelessness impacts all aspects of a person’s life – mental, emotional and physical – and places the life of a man, woman or child at great risk. When natural disasters such as floods occur, homeless people often bear the brunt of the devastation and lose the little that they have.\n\nb. Profile of the NGO - Youngistaan Foundation:\n\ni. What is Youngistaan? \nYoungistaan Foundation is an NGO based in India that works to improve the lives of the most underprivileged and disadvantaged people through programs that address: hunger, homelessness, poverty, education inequity, gender inequality, taboos on menstruation, emergency responses, animal rights, capacity building and many more issues. The NGO was first formed in 2012 and was officially registered in 2014.\n\nii. Mission and Objective:\nEmpowering young people and communities to become catalysts of positive change, addressing livelihood, education, health, climate, and gender disparities for a more equitable, inclusive and sustainable future.\n\niii. Programs and Target Beneficiaries:\nTheir various programs address multiple issues such as hunger, homelessness, gender, education, animal welfare, youth, emergency responses and more. Some of such programs are the Rehabilitation and Livelihood Program, Emergency Response Program.\n\niv. Collaborations and Partnerships:\nYoungistaan mainly looks for collaborations with like-minded people who want to heavily impact people’s lives. They mostly partner up with other programs and organizations that are sustainable and aim to have a long-lasting effect on society.\nA few of their mentionable partnerships are UNICEF, Dr. Reddy’s, She Teams, Telangana State Police, JP Morgan Chase & Co.\n\nv. Funding and Sustainability:\nMain sources of funding for this organization are donations and additional funds from collaborators. For specific programs they are also aided by the certain sectors of the Government of India like GHMC and Telangana State Police.\n\nvi. Target Beneficiaries and Impact Assessment:\nThe programs offered by this NGO focuses on helping children, women, men, people with disabilities, senior citizens, queer communities and individuals from marginalized communities.\nThey have reached out to and helped 2,000+ homeless people with transformative care and tend to keep track of their impact by partnering with old age homes, other homeless shelters and counselling services and social media platforms.\n\nvii. Structure of Organization:\nThe NGO is led by various governing bodies such as trustees, an executive board, directors, program heads and volunteers.\n\nviii. Funding and Sustainability:\nMain sources of funding for this organization are donations and additional funds from collaborators. For specific programs they are also aided by the certain sectors of the Government of India like GHMC and Telangana State Police.\n\nix. Social Responsibility and Community Involvement:\nThe views of this NGO are that spreading awareness about social issues and the programs that are available to assist these issues is a vital priority. By doing so, the citizens or the people who want to take part in these causes can fulfil their role in helping society. The NGO highly values donations and volunteers.\n3. Objectives of the Study:\n\nThe objectives of this study were to understand the working of organizations like NGO’s and understand the various efforts that go into community-based programs. Another priority was to strengthen our perspective on the homelessness crisis in India and understand ways in which we can contribute towards the betterment of this issue.\n4. Literature Review:\n\nThe Youngistaan Foundation is dedicated to addressing various issues including hunger, homelessness, gender, education, animal welfare, youth, and emergency responses. \nYoungistaan Foundation held its 8th Grand Annual Carnival, providing an unforgettable experience for 260 underprivileged children. The foundation, in collaboration with Telangana State Police, supplied 500 nutrition packages to families of daily wage and migrant workers living in and around the Nallamala forest at Nagarkurnool. They also reached out to 200 handloom weavers in Bhoodan Pochampally, providing them with a nutrition package and hygiene kit. Youngistaan has distributed nutrition kits to the city and is planning to support at least 1,000 people until the end of this month. The foundation also provides physical transformations for homeless people in need, including showers and cleanups.\nThe Youngistaan Foundation provides year-round outreaches to those in need of essential items like food, water, clothing, sanitation, and menstrual hygiene products. These campaigns\nencourage individuals of all ages to actively participate in addressing significant issues and contributing to a better world through their small actions.\n5. Methodology:\nThe methods used to conduct this study were a questionnaire and an interview.\nAn interview was held with Arun Daniel Yelamatty, the founder and president of the Youngistaan organization. The questions were asked from a predesigned set of questions prepared by us to enquire about the working and main objectives of the organization.\n\n(Insert pics here)\n6. Discussion and Analysis:\n\nThe major challenges faced by the NGO since its establishment are\nLack of awareness\nLack of funding\nLack of initiative\n\nWays for society to help overcome these challenges is to spread awareness, spend more time getting to know their various programs and working with them regularly. The NGO would highly benefit from regular volunteering services and for more information visiting their website is an important resource.\n\n7. Personal Reflections:\n\n(Mancy)\nAs I spoke with the beneficiaries and the team members, what really stood out to me was the atmosphere of unity and support in the space. It was evident that the Youngistaan Foundation was a community driven by a shared vision of providing a better future for the homeless people, rather than merely an organization. In addition, my visit left a deep impression on me and reinforced my faith in the ability of grassroots initiatives to bring about significant change.\n\n(Lalitha)\nVisiting the Youngistaan NGO was a deeply moving experience. Listening to the problems of the residents there, I was inspired on how they did not give up on life though they went through endless difficulties. I was struck by the organizations dedication and empathy to help homeless people in the society. It was a humbling reminder on how empathy is important for the society in addressing homelessness.\n\n(Mahita)\nI firmly believe that Youngistan is one of the most admirable organizations, as they have consistently shown a dedication to quality. Their hard work is well planned, with the goal of ensuring long-term advantages for the people that fall under their charitable sphere. One of the most important things I learned from working with Youngistan is that they take a comprehensive approach that goes beyond short-term effects. In addition to providing prompt assistance, they also enable people to become self-sufficient by offering them complete medical treatment and enlightening counselling. Such diligent work for individuals who are often forgotten by society currents stirs up a really moving feeling.\n\n\n\n(Yashaswini)\nWhen talking to Arun Daniel Yellamaty, the founder and president of Youngistaan I was enthralled by the dedication and commitment to his work and visiting the organization made it crystal clear how important his and his team's efforts are. The camaraderie among all the staff members was refreshing to see and watching them work towards achieving the same goal of helping everyone and anyone as much as possible left me feeling motivated and strengthened my belief in community-based social initiatives. Talking to the people who have received help from this organization and watching them get excited about receiving safe and basic human needs made me realize that sometimes even the smallest of efforts has the capability of changing someone's lives.\n\n8. Conclusion: \n\nThe Youngistaan organization is working for a greater cause and going out of their way to help people who need shelter for various extraneous reasons. The have an unwavering commitment towards the residents and have the utmost determination, patience and passion for making a difference in the lives they serve. The organization conducts programs such as Transformers program for rehabilitation and youth nurturing program for underprivileged children to keep the youth motivated and involved. The organization also helps the youth through skill development centres for finding their passion and also earning their livelihood.\n\n9. Scope of the Study:\n\nThe main scope of this study was to analyse the conditions of homeless people taken in by the NGOs. We tried to understand their everyday living conditions and services received and how they benefited from the organization. One of the limitations of the study is the time we spent working with the organization. With the available resources given the study could only capture a few elements of the various programs conducted by the organization and the impact of their work. \n\n\n10. References:\n\nTitle: \nSource:\nDate:\nLink:\n\nhttps://youngistaanfoundation.org/\n\nhttps://youngistaanfoundation.org/transformers-2/\n\nhttps://youngistaanfoundation.org/in-the-news/\n\nhttps://www.thehansindia.com/news/cities/hyderabad/hyderabad-youngistaan-regales-deprived-children-663073\n\nhttps://www.thehansindia.com/telangana/youngistaan-foundation-along-with-telangana-state-police-extends-its-relief-support-to-tribal-families-in-nallamalla-forest-622035\n\nhttps://lifeandmore.in/life-style/fashion-beauty/telangana-ngo-handloom-weavers/\n\nhttps://timesofindia.indiatimes.com/city/hyderabad/Trans-community-hit-hard-by-pandemic/articleshow/76669274.cms\n\nhttps://www.storypick.com/homeless-people-transformation/\n"
}