{
  "document_id": "DIVAMI_006",
  "source_system": "GoogleDrive",
  "original_filename": "COMMUNITY SERVICE REPORT.docx",
  "format": "DOCX",
  "date_created": "",
  "last_modified": "2024-03-05T05:25:35.000Z",
  "date_received": "2025-06-10T06:47:48.720115Z",
  "ingested_at": "2025-06-10T07:02:28.274278Z",
  "status": "Processed",
  "summary": "The study focuses on the homelessness crisis in India, where estimates range from 1.7 million to 3 million people living on the streets. This situation leads to various issues such as poor health, substance abuse, child labor, trafficking, and lack of access to basic services. Youngistaan Foundation, an Indian NGO, aims to improve the lives of underprivileged individuals through programs addressing hunger, homelessness, poverty, education inequity, gender inequality, menstruation taboos, emergency responses, animal rights, capacity building, and more. The mission is to empower young people and communities to bring about positive change in livelihood, education, health, climate, and gender disparities for a more equitable, inclusive, and sustainable future.\n\nYoungistaan has helped over 2,000 homeless individuals with transformative care, tracking their impact through partnerships with old age homes, shelters, counseling services, and social media platforms. The organization faces challenges like lack of awareness, funding, and initiative, which can be addressed by spreading awareness, learning about their programs, and volunteering regularly.\n\nThe study's participants shared personal reflections on the unity and support within the Youngistaan community, the dedication and empathy of the organization towards helping homeless people, and the impact of grassroots initiatives in bringing about significant change. Youngistaan conducts various programs like the Transformers program for rehabilitation",
  "embedding_file_path": "D:\\Users\\Yashu\\Projects\\divami\\internal_data\\internal-processed-docs\\embeddings\\DIVAMI_006_emb.npy"
}